app/controllers/cinemas_controller.rb

INSERT INTO `cinemas` (`address`, `created_at`, `description`, `name`, `updated_at`) VALUES ('...', '2014-10-01 19:16:42', 'херь', 'xd', '2014-10-01 19:16:42')
---
    def create
    	@cinema = Cinema.new(cinema_params)

        if @cinema.save

SELECT `cinemas`.* FROM `cinemas` WHERE `cinemas`.`id` = 1 LIMIT 1
---
    def show
        @cinema = Cinema.find(params[:id])

SELECT `cinemas`.* FROM `cinemas`
---
    def index
        @cinemas = Cinema.all

SELECT `cinemas`.* FROM `cinemas` WHERE `cinemas`.`id` = 1 LIMIT 1
DELETE FROM `cinemas` WHERE `cinemas`.`id` = 1
---
	def destroy
	  	@cinema = Cinema.find(params[:id])
	  	@cinema.destroy