app/controllers/films_controller.rb

    def create
    	@film = Film.new(film_params)

        if @film.save
---
INSERT INTO `films` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-10-01 18:11:59', 'ужас нах', 'у холмов есть глаза', '2014-10-01 18:11:59')

	def edit
	    @film = Film.find(params[:id])
---
SELECT `films`.* FROM `films` WHERE `films`.`id` = 1 LIMIT 1

	def update
	    @film = Film.find(params[:id])

	    if @film.update(film_params)
---
SELECT `films`.* FROM `films` WHERE `films`.`id` = 1 LIMIT 1
UPDATE `films` SET `description` = 'хей-хо', `updated_at` = '2014-10-01 18:49:27' WHERE `films`.`id` = 1

    def show
        @film = Film.find(params[:id])
---
SELECT `films`.* FROM `films` WHERE `films`.`id` = 2 LIMIT 1

	def index
        @films = Film.all
---
SELECT `films`.* FROM `films`

	def destroy
	  	@film = Film.find(params[:id])
	  	@film.destroy
---
SELECT `films`.* FROM `films` WHERE `films`.`id` = 1 LIMIT 1
DELETE FROM `films` WHERE `films`.`id` = 1