app/controllers/search_controller.rb

SELECT `films`.* FROM `films` WHERE (name LIKE '%холм%')
---
  def by_film_result
	  if params[:search] && params[:search] != nil && params[:search] != ""
          @films = Film.search(params[:search])

SELECT `cinemas`.* FROM `cinemas` WHERE (name LIKE '%123%')
---
  def by_cinema_result
	  if params[:search] && params[:search] != nil && params[:search] != ""
          @cinemas = Cinema.search(params[:search])