app/controllers/sessions_controller.rb

	def new
		@session = Session.new
        @films = Film.all
        @cinemas = Cinema.all
---
SELECT `films`.* FROM `films`
SELECT `cinemas`.* FROM `cinemas`

	def edit
	    @session = Session.find(params[:id])
        @cinema = Cinema.find(@session.cinema_id)
        @film = Film.find(@session.film_id)
---
SELECT `cinemas`.* FROM `cinemas` WHERE `cinemas`.`id` = 3 LIMIT 1
SELECT `films`.* FROM `films` WHERE `films`.`id` = 3 LIMIT 1

    def show
        @session = Session.find(params[:id])
        @cinema = Cinema.find(@session.cinema_id)
        @film = Film.find(@session.film_id)
---
SELECT `cinemas`.* FROM `cinemas` WHERE `cinemas`.`id` = 1 LIMIT 1
SELECT `films`.* FROM `films` WHERE `films`.`id` = 2 LIMIT 1